[
	{
		"title": "Overworld_Elder",
		"tags": "",
		"body": "As you walk through the village square, you spot the elder sitting on a wooden bench, watching the passersby. When you approach, the elder's face lights up with a warm smile.\n\nElder: \"Oh hello, traveller! I've been looking for you everywhere! It seems as if...\n\n[[I could use your help with a small matter!|elder_request]]\"",
		"position": {
			"x": 50,
			"y": 50
		},
		"colorID": 2
	},
	{
		"title": "elder_request",
		"tags": "",
		"body": "Elder: \"I have a bit of trouble with that new gadget my grandson sent me. These newfangled devices confuse me, but you seem to know your way around them. Could you spare a moment to help?\"\n\n[[Agree to help the elder with their device.|Start_Elder]]\n[[Politely decline, saying you're in a rush.|elder_decline]]",
		"position": {
			"x": 300,
			"y": 50
		},
		"colorID": 0
	},
	{
		"title": "elder_decline",
		"tags": "",
		"body": "Elder: \"Ah, I understand, dear. You're busy, and time waits for no one! Perhaps later, when you're free.\"\n\nYou bid farewell, knowing the elder will be waiting patiently for help.",
		"position": {
			"x": 596,
			"y": 44
		},
		"colorID": 1
	},
	{
		"title": "Overworld_Teacher",
		"tags": "",
		"body": "You stroll through the school grounds, noticing Mr. Rhodes pacing nervously outside the computer lab. He waves excitedly as soon as he spots you.\n\nMr. Rhodes: \"Oh hello, traveller! I've been looking for you everywhere! It seems as if... \n\n[[We have a bit of a tech emergency on our hands.|teacher_request]]\"",
		"position": {
			"x": 50,
			"y": 300
		},
		"colorID": 2
	},
	{
		"title": "teacher_request",
		"tags": "",
		"body": "Ms. Rhodes: \"The computer lab's main machine is acting up again, and you're the only one who seems to know how to handle it! Would you mind lending a hand before the class starts?\"\n\n[[Agree to help Ms. Rhodes troubleshoot.|teacher_accept]]\n[[Decline, mentioning you have other pressing matters.|teacher_decline]]",
		"position": {
			"x": 300,
			"y": 300
		},
		"colorID": 0
	},
	{
		"title": "teacher_decline",
		"tags": "",
		"body": "Ms. Rhodes: \"Ah, no worries! I know you've got your own adventures to handle. If you change your mind, I'll be here fighting with the tech until then.\"\n\nYou give a nod of understanding and continue on your way.",
		"position": {
			"x": 598,
			"y": 292
		},
		"colorID": 1
	},
	{
		"title": "Start_Elder",
		"tags": "",
		"body": "<<switch_elder_scene>>\n\nYou enter the elder's cozy living room, and they ask for help setting up a new device.",
		"position": {
			"x": 299,
			"y": -221
		},
		"colorID": 2
	},
	{
		"title": "elder_setup_instructions",
		"tags": "",
		"body": "Elder: \"Thank you, dear. My eyes aren't as sharp as they used to be! My grandson says it's just a few simple steps to get this up and running.\"\n\n[[Select language for the device.|step_1]]",
		"position": {
			"x": 588,
			"y": -219
		},
		"colorID": 0
	},
	{
		"title": "step_1",
		"tags": "",
		"body": " <<select_wifi>> \nYou will have to use your mouse pointer for this activity. Select a Wi-Fi connection for the device.\n <<select_lang>>\nSelect a language for the device.\n<<finish_screen>> \nFinished!",
		"position": {
			"x": 876,
			"y": -223
		},
		"colorID": 0
	},
	{
		"title": "elder_end",
		"tags": "",
		"body": "<<activity_end>> \nElder: \"Thank you so much! I can actually see what I'm doing now. You're a lifesaver!\"",
		"position": {
			"x": 1175,
			"y": -223
		},
		"colorID": 0
	},
	{
		"title": "Start_Teacher",
		"tags": "",
		"body": "You arrive at school and see Ms. Rhodes struggling with a computer in the lab.\n\n[[Offer to help Ms. Rhodes.|teacher_request]]",
		"position": {
			"x": 50,
			"y": 300
		},
		"colorID": 2
	},
	{
		"title": "workstation_assembly",
		"tags": "",
		"body": "Teacher: Here is all the equipment we got in.\nIan: Cool. My partner will be showing you how to assemble the equipment\n<<switch_scene>>\nHere we go!\n",
		"position": {
			"x": 302,
			"y": 594
		},
		"colorID": 8
	},
	{
		"title": "teacher_accept",
		"tags": "",
		"body": "<<switch_teacher_scene>>\n\nMr. Rhodes: \"Ah, thank you so much! Let's get started!\"",
		"position": {
			"x": 34,
			"y": 597
		},
		"colorID": 0
	},
	{
		"title": "activity_completed",
		"tags": "",
		"body": " \nActivity completed! What's next?",
		"position": {
			"x": 53,
			"y": -221
		},
		"colorID": 0
	},
	{
		"title": "you_already_did_me",
		"tags": "",
		"body": "Thanks for the help, traveller! You're amazing!",
		"position": {
			"x": -180,
			"y": -222
		},
		"colorID": 0
	},
	{
		"title": "workstation_activity_start",
		"tags": "",
		"body": "Drag and drop the equipment onto the desk to assemble the workstation.\nIan: Let's start with dragging the Tower Unit onto the table.\n<<place_tower>> \nIan: Good job. Now, drag the Monitor onto the table.\n<<place_monitor>> \nIan: Great. Now, drag the Keyboard and Mouse onto the table.\n<<place_peripherals>>",
		"position": {
			"x": 598,
			"y": 588
		},
		"colorID": 0
	}
]